{
  "subscribe": [
    {
      "id": 1,
      "name": "sithule",
      "email": "sithuletshangana@webmail.co.za"
    },
    {
      "email": "ridhaa@gmail.com",
      "id": 2
    },
    {
      "name": "otherperson",
      "email": "otherperson@mail.com",
      "id": 3
    }
  ],
  "users": [
    {
      "id": 1,
      "user": "Sithule",
      "email": "sithuletshangana@webmail.co.za",
      "password": "123"
    }
  ],
  "posts": [
    {
      "id": 1,
      "author": "Sesona Ngqakamba",
      "title": "Education is essential, but not an essential service – NGO",
      "date": "2018 June 23",
      "summary": "Equal Education (EE) says government's call to declare education an essential service will not solve the fundamental prevailing problems within the education sector. This declaration would not address, among others, issues of poor infrastructure, lack of resources and overcrowding in schools, EE said in a statement on Monday.The organisation also said declaring education an essential service undermined the legitimacy of the grievances that teachers try to raise through the right to strike.",
      "content": "                                                      Equal Education (EE) says governments call to declare education an essential service will not solve the fundamental prevailing problems within the education sector. This declaration would not address among others issues of poor infrastructure lack of resources and overcrowding in schools EE said in a statement on Monday.The organisation also said declaring education an essential service undermined the legitimacy of the grievances that teachers try to raise through the right to strike. On June 15 the Department of Labours essential services committee issued a public notice which highlighted the governments intention to review its list of essential services under the Labour Relations Act. In 2013 former ANC secretary general Gwede Mantashe said education would be declared an essential service. Discussion and hard work both within and outside the sector is needed in order to improve academic outcomes in South Africa. We must strive for an education system that ensures that all learners in public schools receive quality education and that teachers as the facilitators of this process are treated with fairness dignity and respect. However declaring basic education an essential service is not a viable way of achieving what we envision.The resurgence of declaring basic education an essential service, follows a five-year hiatus by the government. In February 2013, former ANC Secretary-General, Gwede Mantashe reported, after an ANC lekgotla, that education would be declared an “essential service”. Several weeks later, in his State of the Nation Address, former President, Jacob Zuma said that, by declaring the education sector an essential service, the government was not looking to take away the constitutional right of teachers, as workers, to strike.  Yet, this is exactly what declaring a sector an essential service means \r\n              \r\n              \r\n              ",
      "image": "https://st2.depositphotos.com/1047356/10362/i/950/depositphotos_103620284-stock-photo-education-abstract-word-cloud.jpg"
    },
    {
      "id": 2,
      "author": "Gareth Beavis",
      "title": "The best smartphone now is the Galaxy S9 Plus",
      "date": "2018 July 23",
      "summary": "What makes a great smartphone? Is it one that really looks the business, lasts the longest, has the most amazing screen or takes the best snaps? Of course, this is a trick question, as it's all these things and far more.Here at TechRadar, we know the pain of trying to pick the right smartphone for you - which is why we spend hours and hours agonising over which to recommend for you. We know that you're here for either inspiration or to make sure the phone you're looking at isn't a dud (or maybe both), and we've gathered a real selection for you.",
      "content": "What makes a great smartphone? Is it one that really looks the business, lasts the longest, has the most amazing screen or takes the best snaps? Of course, this is a trick question, as it's all these things and far more.Here at TechRadar, we know the pain of trying to pick the right smartphone for you - which is why we spend hours and hours agonising over which to recommend for you. We know that you're here for either inspiration or to make sure the phone you're looking at isn't a dud (or maybe both), and we've gathered a real selection for you.<br><br> There are a few brands you'll see a lot here - it won't surprise you to see that Samsung and Apple are prominent, but Huawei is now becoming a real brand to consider, LG is still offering some top phones and the likes of Honor and OnePlus are  still bringing out excellent choices for those on more of a budget.That's one of the key things we take into account: the price of the phone, as it's something that will be a real barrier to entry for most. While many of the phones here are on the higher end of the price scale, that's because they offer a brilliant experience and we think that's worth investing in, when you're going to be using this thing every day.If you do want to check out something a little cheaper, our list of the best budget phones 2018 is right here for your delectation).For some further (or more targeted) light reading, head to our best iPhone or best Android phone guides.<br><br> Maybe you're more of a brand loyalist though, in which case go for our list of the best Samsung phones.But if you just want to know the very best of the best around at the moment, here's where you should be looking: The Samsung Galaxy S9 Plus is a big phone that's designed for big hands - and it takes the very best of what's on the smartphone market and puts it together in a compelling package that we've loved testing, despite the strong competition on the following pages.<br><br>Screen: The Super AMOLED 6.2-inch display has been measured as one of the very best around right now, with super colours, great dynamic range and, essentially, the very best viewing experience you can have on a mobile phone.Battery life: The battery life on the S9 Plus is better than that seen on the smaller S9, thanks to the 3,500mAh battery in the Plus model - although it's probably the weakest part of the phone, not offering as much life as we'd have liked.Camera: The camera on the Galaxy S9 Plus is among the best on the market, and the dual-aperture capability offers some startlingly good snaps when things get a little darker. Colours can look a tad washed out when the exposure is higher, but the power of the sensor, with memory built into it to make it smarter than most rivals, offers very low-noise shots.Mini verdict: If you're after a bigger phone with all the features that matter on board, the Galaxy S9 Plus is that and more.",
      "image": "https://pctechmag.com/wp-content/uploads/2017/04/S8-Duo-Launch.jpg"
    },
    {
      "id": 3,
      "author": "Dmytro Brovkin",
      "title": "Best 10 Programming Languages to learn in 2018",
      "date": "7 Dec 17",
      "summary": "Staying on top is one of the key factors for business and technological innovation. And with over 600 unique programming languages, deciding on the best programming language for your project may be difficult, and can be the hardest part in the initial development phase.And to help, here’s our list of the top 10 potential programming languages to learn in 2018, to help decide the best programming language to use for your project is to evaluate your project needs.1. Swift: More popular than Objective-C, this is the language for developing native iOS or Mac OS apps, and is the programming language with the most potential for reshaping the future.",
      "content": "Staying on top is one of the key factors for business and technological innovation. And with over 600 unique programming languages, deciding on the best programming language for your project may be difficult, and can be the hardest part in the initial development phase.And to help, here’s our list of the top 10 potential programming languages to learn in 2018, to help decide the best programming language to use for your project is to evaluate your project needs. 1. Swift: More popular than Objective-C, this is the language for developing native iOS or Mac OS apps, and is the programming language with the most potential for reshaping the future. Native apps have been found to outperform cross-platform hybrid apps, and SpriteKit makes it even easier to build 2D games. Indeed, it builds itself on the successes of C and Objective-C without the constraints of compatibility.<br><br> It was heavily influenced by Ruby and Python, and is considered user friendly and fun to use. Operating as a high level language, generally being easy to maintain, Swift is a general purpose, multi paradigm language developed by Apple for iOS. So if working with Apple products is your niche, this is the language for you. Being a statically typed language means that Xcode checks your errors for you, so your errors are easier to track down, and further, as the definition of things are more definite, it operates faster. 5. C: Established in 1972 to enable programmers to write in the UNIX operating system, it still proves very, very popular. It’s one of the most widely used programming languages in the world. And because it operates as at a ‘machine level’ language’ you’ll be able to learn how a program interacts with hardware. Not only is it one of the most stable languages, it works on nearly all computing platforms.Dropbox, eBay, and Spotify all use C programming, and the entirety of the Linux OS is written using C language.6. Javascript: It came up as the most used programming by developers, at 62.5%, as taken in the Stack Overflow Developer Survey, which surveryed over 64,000 developers in 173 countries.<br><br> It allows you to build interactive websites, and is truly an essential web tool technology, alongside HTML and CSS, because most browsers in some way implement JavaScript.It’s crucial for getting into web development, and learning this language paves the way for front end development and back end development. It might not be as useful as Python or Java, but it’s generally easier to pick and do something tangible with, in part because of all of the accessible UI features.For making interactive things for the web, Javascript is to go, you’ll see immediate results from your coding efforts with little tools. Adding on to this, Javascript usage has extended to include mobile app development, game development, and desktop app development. It’s definitely exploded in popularity, and is definitely one of the best programming languages out there.7. Java: Java is one of the most practical languages to learn as it was designed to bypass the complexity of C++. It’s popularity cannot be overstated, as the majority (90%) of Fortune 500 companies use Java to develop backend systems and desktop apps. It’s highly portable as it boasts the cross platform compatible Java Virtual Machine (JVM).Reinforces Object-oriented principles (OOP) used in modern languages including C++, Perl, Python, and PHP. Java is used mainly for creating server side apps, video games, and mobile apps. It’s the core of native Android apps and is enormously popular among developers.8. C#: Designed by Microsoft, this general purpose, multi paradigm programming language was used for developing apps on the Microsoft platform.<br><br>  C# operates as a general purpose, object oriented programming language. It works for apps powered by .NET frameworks. So, if that’s your market, C# is the best language to use for building apps native to the Microsoft platform, and is further the recommended language for developing games using the Unity Game engine.It was designed with simplicity and ease of use as a priority, and because it’s a high level language it reads closer to English. As a language, C# abstracts the complex details of the computer so you as the developer can focus on programming instead of worrying about the little details.You can make anything in C#, from web services to mobile apps, server applications and more. Whilst experts contend that demand for C# is dipping, Xamarin changes those expectations, as the platform makes creating apps for Android and iOS much simpler.9. Objective-C: It is a general purpose, object orientated language derived from C, and was used extensively by Apple for iOS and OS X development before Swift. Indeed, although Swift has gained much popularity, Objective-C is still worth learning because you can create all types of apps, and iOS frameworks still rely on Objective-C.<br><br>  It’s simple to use, and furthermore, can use programming languages C++ and C whilst programming with C.It works smoothly with Apple, and supports dynamic typing. As a language, knowing Objective-C is a great way to invest into your knowledge portfolio, and is especially useful for those who are interested in making apps for the App Store. It’s thus great for making native apps that are smooth and efficient for iOS software’s.10. Rust: Rust came in first place in the 2016 the Stack Overflow Developer Survey for what developers loved most. Rust popped up as the programming language developers loved most (at 79.1%). Indeed, new developers love Rust. Developed by the Mozilla Foundation, the open source Rust programming language operates as a low level language, suited for performance critical code.What’s most interesting about it is that it emphasises safe code (i.e. the objects are managed by the programming language from beginning to the end). Rust might be the new kid on the block, but it contends with C++ and C as a potent programming language with its resource management algorithm. It borrows the concept of mutable borrowing to make resource management a streamlined, elegant process.",
      "image": "https://thumbnails-visually.netdna-ssl.com/zealous-system--web-and-mobile-development-company_525d87e1164a0_w1500.jpg"
    },
    {
      "title": "‘MOMENTUM OF PETROL INCREASES HAS BEEN BROKEN’",
      "author": " Eyewitness News ",
      "image": "https://cdn.primedia.co.za/primedia-broadcasting/image/upload/c_fill,h_289,q_70,w_463/btdedepjo8c0ix0ems9c",
      "date": "2018-07-30",
      "content": "<p style=\"margin-bottom: 1.42857rem; padding: 0px; font-family: &quot;Open Sans&quot;, sans-serif; line-height: 1.6; text-rendering: optimizeLegibility; color: rgb(26, 26, 26);\">JOHANNESBURG - With fuel prices going up again on Wednesday, economists say the momentum of the increases has been broken.</p><p style=\"margin-bottom: 1.42857rem; padding: 0px; font-family: &quot;Open Sans&quot;, sans-serif; line-height: 1.6; text-rendering: optimizeLegibility; color: rgb(26, 26, 26);\">The Department of Energy announced the fifth fuel hike for this year with petrol going up by one cent a litre.</p><p style=\"margin-bottom: 1.42857rem; padding: 0px; font-family: &quot;Open Sans&quot;, sans-serif; line-height: 1.6; text-rendering: optimizeLegibility; color: rgb(26, 26, 26);\">You'll also have to fork out 4 cents more for illuminating paraffin. Diesel prices, though, will decrease by 4c.</p><p style=\"margin-bottom: 1.42857rem; padding: 0px; font-family: &quot;Open Sans&quot;, sans-serif; line-height: 1.6; text-rendering: optimizeLegibility; color: rgb(26, 26, 26);\">Economist Mike Schussler said: “I think there’s a good chance that we could see a few cents coming off the price in the next few months of petrol. And diesel’s decline could also help us with our fighting against inflation later.”</p><p style=\"margin-bottom: 1.42857rem; padding: 0px; font-family: &quot;Open Sans&quot;, sans-serif; line-height: 1.6; text-rendering: optimizeLegibility; color: rgb(26, 26, 26);\">Economist Azar Jammine says it is good news for all consumers.</p><p style=\"margin-bottom: 1.42857rem; padding: 0px; font-family: &quot;Open Sans&quot;, sans-serif; line-height: 1.6; text-rendering: optimizeLegibility; color: rgb(26, 26, 26);\">“For the average men in the street, that provides a little bit of a relief after having seen fuel prices rising by nearly 20% in the preceding four months. This should provide a little bit of scope for spending to maintain some growth.”JOHANNESBURG - With fuel prices going up again on Wednesday, economists say the momentum of the increases has been broken.</p><p style=\"margin-bottom: 1.42857rem; padding: 0px; font-family: &quot;Open Sans&quot;, sans-serif; line-height: 1.6; text-rendering: optimizeLegibility; color: rgb(26, 26, 26);\">The Department of Energy announced the fifth fuel hike for this year with petrol going up by one cent a litre.</p><p style=\"margin-bottom: 1.42857rem; padding: 0px; font-family: &quot;Open Sans&quot;, sans-serif; line-height: 1.6; text-rendering: optimizeLegibility; color: rgb(26, 26, 26);\">You'll also have to fork out 4 cents more for illuminating paraffin. Diesel prices, though, will decrease by 4c.</p><p style=\"margin-bottom: 1.42857rem; padding: 0px; font-family: &quot;Open Sans&quot;, sans-serif; line-height: 1.6; text-rendering: optimizeLegibility; color: rgb(26, 26, 26);\">Economist Mike Schussler said: “I think there’s a good chance that we could see a few cents coming off the price in the next few months of petrol. And diesel’s decline could also help us with our fighting against inflation later.”</p><p style=\"margin-bottom: 1.42857rem; padding: 0px; font-family: &quot;Open Sans&quot;, sans-serif; line-height: 1.6; text-rendering: optimizeLegibility; color: rgb(26, 26, 26);\">Economist Azar Jammine says it is good news for all consumers.</p><p style=\"margin-bottom: 1.42857rem; padding: 0px; font-family: &quot;Open Sans&quot;, sans-serif; line-height: 1.6; text-rendering: optimizeLegibility; color: rgb(26, 26, 26);\">“For the average men in the street, that provides a little bit of a relief after having seen fuel prices rising by nearly 20% in the preceding four months. This should provide a little bit of scope for spending to maintain some growth.”</p>",
      "summary": "JOHANNESBURG - With fuel prices going up again on Wednesday, economists say the momentum of the increases has been broken.\r\n\r\nThe Department of Energy announced the fifth fuel hike for this year with petrol going up by one cent a litre.\r\n\r\nYou'll also have to fork out 4 cents more for illuminating paraffin. Diesel prices, though, will decrease by 4c.\r\n\r\nEconomist Mike Schussler said: “I think there’s a good chance that we could see a few cents coming off the price in the next few months of petrol. And diesel’s decline could also help us with our fighting against inflation later.”",
      "id": 4
    }
  ]
}